def get_coordinates():
    # Global 좌표
    standing = [
        [-0.000003, 0.025424, 0.441971],  # 머리마루점(Occipital bone)
        [-0.046556, -0.068851, 0.328275],  # 눈초리점(Eye Socket, 우)
        [0.046712, -0.06869, 0.328387],  # 눈초리점(Eye Socket, 좌)
        [-0.076753, 0.002704, 0.309184],  # 귀구슬점(Earlobe, 우)
        [0.076753, 0.002704, 0.309184],  # 귀구슬점(Earlobe, 좌)
        [-0.077523, 0.00283, 0.320535],  # 귀바퀴위뿌리점(Tragus, 우)
        [0.077523, 0.00283, 0.320535],  # 귀바퀴위뿌리점(Tragus, 좌)
        [0.000073, -0.092186, 0.351445],  # 눈살점(Glabella)
        [0.000269, -0.093741, 0.337248],  # 코뿌리점(Sellion)
        [0.000015, -0.090321, 0.210503],  # 턱끝점(Menton)
        [-0.000003, 0.116093, 0.352571],  # 뒤통수 돌출점(Occiput)
        [-0.000003, 0.07858, 0.251812],  # 뒤통수점(Inion)
        [-0.068402, -0.03547, 0.347917],  # 머리옆점(Euryon, 우)
        [0.068958, -0.034751, 0.348294],  # 머리옆점(Euryon, 좌)
        [-0.03405, -0.077515, 0.322053],  # 눈확아래점(Inferior Orbitale, 우)
        [0.033958, -0.077413, 0.322128],  # 눈확아래점(Inferior Orbitale, 좌)
        [0.000004, 0.097569, 0.157897],  # 목뒤점(Cervicale)
        [0.000005, -0.030337, 0.12267],  # 목앞점(Anterior Neck)
        [-0.060985, 0.007459, 0.180173],  # 목옆점(Lateral Neck, 우)
        [0.060985, 0.007459, 0.180173],  # 목옆점(Lateral Neck, 좌)
        [-0.000006, -0.046593, 0.177639],  # 방패연골아래점(Inferior Thyroid)
        [-0.179889, 0.024175, 0.151491],  # 어깨점(Acromion, 우)
        [0.179892, 0.024178, 0.151493],  # 어깨점(Acromion, 좌)
        [-0.118015, 0.038155, 0.154849],  # 어깨가쪽점(Lateral Shoulder, 우)
        [0.118019, 0.03816, 0.15485],  # 어깨가쪽점(Lateral Shoulder, 좌)
        [-0.221789, 0.028579, -0.003102],  # 겨드랑이점(Axilla, 우)
        [0.221788, 0.028579, -0.003101],  # 겨드랑이점(Axilla, 좌)
        [-0.207827, -0.004973, 0.017877],  # 겨드랑앞점(Anterior Axilla, 우)
        [0.207826, -0.004974, 0.01788],  # 겨드랑앞점(Anterior Axilla, 좌)
        [-0.222151, 0.082484, -0.004028],  # 겨드랑뒤점(Posterior Axilla, 우)
        [0.222146, 0.082482, -0.004028],  # 겨드랑뒤점(Posterior Axilla, 좌)
        [-0.144859, -0.051765, 0.064081],  # 겨드랑앞벽점(AnterioridAxilla, 우)
        [0.144859, -0.051765, 0.064081],  # 겨드랑앞벽점(AnterioridAxilla, 좌)
        [-0.14755, 0.116413, 0.098559],  # 겨드랑뒤벽점(PosterioridAxilla, 우)
        [0.147547, 0.116415, 0.098557],  # 겨드랑뒤벽점(PosterioridAxilla, 좌)
        [0.000003, 0.124056, 0.064129],  # 등뼈위겨드랑수준점(Axillary Level atidspine)
        [-0.199998, -0.030044, 0.035669],  # 겨드랑앞접힘점(Anterior Axillary Fold, 우)
        [0.199999, -0.030045, 0.035673],  # 겨드랑앞접힘점(Anterior Axillary Fold, 좌)
        [-0.222151, 0.082484, -0.004028],  # 겨드랑뒤접힘점(Posterior Axilla Fold, 우)
        [0.222146, 0.082482, -0.004028],  # 겨드랑뒤접힘점(Posterior Axilla Fold, 좌)
        [0.000004, -0.078771, 0.032336],  # 복장뼈가운데점(Mesosternal)
        [-0.107037, -0.105581, -0.050393],  # 젖꼭지점(Nipple, 우)
        [0.107042, -0.105592, -0.050393],  # 젖꼭지점(Nipple, 좌)
        [-0.141385, -0.054797, -0.114868],  # 젖가슴아래수준(Inferior Breast level, 우)
        [0.141385, -0.054797, -0.114868],  # 젖가슴아래수준(Inferior Breast level, 좌)
        [-0.155495, -0.007942, -0.216804],  # 허리옆점(Lateral Waist, 우)
        [0.155496, -0.007948, -0.21681],  # 허리옆점(Lateral Waist, 좌)
        [0.000004, -0.132918, -0.233358],  # 허리앞점(Anterior Waist)
        [-0.000003, 0.091046, -0.236951],  # 허리뒤점(Posterior Waist)
        [-0.155495, -0.007942, -0.216804],  # 허리수준(Lateral Waist level, 우)
        [0.155496, -0.007948, -0.21681],  # 허리수준(Lateral Waist level, 좌)
        [-0.160365, -0.001689, -0.155293],  # 중간허리수준(Midriff level, 우)
        [0.160367, -0.001697, -0.155296],  # 중간허리수준(Midriff level, 좌)
        [0.000002, -0.131549, -0.256985],  # 배돌출점(Stomach tip)
        [0.000001, -0.126774, -0.290072],  # 배꼽점(Stomach navel)
        [-0.164664, 0.013356, -0.270792],  # 배꼽수준허리옆점(Lateral Waist omphalion, 우)
        [0.164664, 0.013356, -0.270792],  # 배꼽수준허리옆점(Lateral Waist omphalion, 좌)
        [-0.000003, 0.100244, -0.289525],  # 배꼽수준허리뒤점(Posterior Waist omphalion)
        [-0.061006, 0.153625, -0.415752],  # 엉덩이돌출점(Buttock Protrusion, 우)
        [0.061006, 0.153625, -0.415752],  # 엉덩이돌출점(Buttock Protrusion, 좌)
        [-0.161288, 0.072614, -0.414878],  # 엉덩이돌출점수준(Buttock Protrusion level, 우)
        [0.161288, 0.072614, -0.414878],  # 엉덩이돌출점수준(Buttock Protrusion level, 좌)
        [-0.062043, 0.13964, -0.367867],  # Top-hip점(Top-hip, 우)
        [0.062042, 0.139637, -0.367867],  # Top-hip점(Top-hip, 좌)
        [-0.062043, 0.13964, -0.367867],  # Top-hip 수준(Top-hip level, 우)
        [0.096788, -0.087541, -0.365453],  # Top-hip 수준(Top-hip level, 좌)
        [-0.083322, 0.123794, -0.344732],  # Upper-hip점(Upper-hip, 우)
        [0.083322, 0.123794, -0.344732],  # Upper-hip점(Upper-hip, 좌)
        [-0.083322, 0.123794, -0.344732],  # Upper-hip 수준(Upper-hip level, 우)
        [0.09703, -0.08834, -0.344718],  # Upper-hip 수준(Upper-hip level, 좌)
        [-0.180726, 0.023082, -0.448773],  # 엉덩이최대둘레수준(Hip-width level, 우)
        [0.180726, 0.023082, -0.448773],  # 엉덩이최대둘레수준(Hip-width level, 좌)
        [-0.090556, 0.113142, -0.540854],  # 볼기고랑점(Gluteal Fold, 우)
        [0.090556, 0.113142, -0.540854],  # 볼기고랑점(Gluteal Fold, 좌)
        [-0.000001, -0.033277, -0.555264],  # 샅점(Crotch)
        [-0.09652, -0.04576, -0.868488],  # 무릎뼈위점(Superior Patella, 우)
        [0.09652, -0.04576, -0.868488],  # 무릎뼈위점(Superior Patella, 좌)
        [-0.095054, -0.036428, -0.893663],  # 무릎뼈가운데점(Midpatella, 우)
        [0.095054, -0.036428, -0.893663],  # 무릎뼈가운데점(Midpatella, 좌)
        [-0.095372, -0.023985, -0.916178],  # 무릎뼈아래점(Inferior Patella, 우)
        [0.095372, -0.023985, -0.916178],  # 무릎뼈아래점(Inferior Patella, 좌)
        [-0.139573, -0.085031, -0.589604],  # 넙적다리가운데점(Midthigh, 우)
        [0.139573, -0.085031, -0.589604],  # 넙적다리가운데점(Midthigh, 좌)
        [-0.091315, 0.08765, -0.860128],  # 오금점(Posterior Juncture of Calf and Thigh, 우)
        [0.091315, 0.08765, -0.860128],  # 오금점(Posterior Juncture of Calf and Thigh, 좌)
        [-0.106494, 0.121945, -1.02879],  # 장딴지돌출점(Calf Protrusion, 우)
        [0.106494, 0.121945, -1.02879],  # 장딴지돌출점(Calf Protrusion, 좌)
        [-0.095621, 0.023354, -1.26868],  # 종아리아래점(Inferior Leg, 우)
        [0.095621, 0.023354, -1.26868],  # 종아리아래점(Inferior Leg, 좌)
        [-0.073176, 0.072344, -1.26141],  # 안쪽발목점(Inner Ankle, 우)
        [-0.125678, 0.079713, -1.25979],  # 안쪽발목점(Outer Ankle, 우)
        [-0.062418, 0.04713, -1.31871],  # 안쪽복사점(Medialalleous, 우)
        [0.062418, 0.04713, -1.31871],  # 안쪽복사점(Medialalleous, 좌)
        [-0.128206, 0.082131, -1.31363],  # 가쪽복사점(Lateralalleous, 우)
        [0.128206, 0.082131, -1.31363],  # 가쪽복사점(Medialalleous, 좌)
        [-0.794376, 0.067816, 0.022871],  # 손바닥중앙점(Hand center, 우)
        [0.794374, 0.067817, 0.022872],  # 손바닥중앙점(Hand center, 좌)
        [-0.113462, -0.021057, -1.38951],  # 발바닥중앙점(Foot center, 우)
        [0.113457, -0.021056, -1.38951],  # 발바닥중앙점(Foot center, 좌)
        [-0.464522, 0.097318, 0.057199],  # 팔꿈치아래점(Bottom olecranon, 우)
        [0.464522, 0.097316, 0.057198],  # 팔꿈치아래점(Bottom olecranon, 좌)
        [-0.715033, 0.093531, 0.048505],  # 손목안쪽점(Ulnar Styloid, 우)
        [0.715033, 0.093531, 0.048505],  # 손목안쪽점(Ulnar Styloid, 좌)
        [-0.340382, 0.004545, 0.063565],  # 두갈래근점(Biceps, 우)
        [0.340382, 0.004545, 0.063565],  # 두갈래근점(Biceps, 좌)
    ]
    sitting = [
        [-0.105341, -0.090454, -0.624696],  # 앉은넙다리위점(Superior Thigh, 우)
        [0.105341, -0.090454, -0.624696],  # 앉은넙다리위점(Superior Thigh, 좌)
        [-0.09652, -0.04576, -0.868488],  # 앉은무릎뼈위점(Superior Patella, 우)
        [0.09652, -0.04576, -0.868488],  # 앉은무릎뼈위점(Superior Patella, 좌)
        [-0.095372, -0.023985, -0.916178],  # 앉은무릎앞점(Anterior Knee, 우)
        [0.095372, -0.023985, -0.916178],  # 앉은무릎앞점(Anterior Knee, 좌)
        [-0.091315, 0.08765, -0.860128],  # 오금점(Posterior Juncture of Calf and Thigh, 우)
        [0.091315, 0.08765, -0.860128],  # 오금점(Posterior Juncture of Calf and Thigh, 좌)
        [-0.178589, 0.010366, -0.388594],  # 앉은엉덩이최대돌출수준(Hip level, 우)
        [0.178589, 0.010366, -0.388594],  # 앉은엉덩이최대돌출수준(Hip level, 좌)
        [0.000002, -0.131549, -0.256985],  # 배돌출점(Stomach tip)
        [0.000001, 0.149724, -0.441748],  # 앉은엉덩이뒤돌출점(Gluteal Prominence)
        [-0.000003, 0.091046, -0.236951],  # 허리뒤점(Posterior Waist)
        [-0.464522, 0.097318, 0.057199],  # 팔꿈치아래점(Bottom olecranon, 우)
        [0.464522, 0.097316, 0.057198],  # 팔꿈치아래점(Bottom olecranon, 좌)
        [-0.794376, 0.067816, 0.022871],  # 손바닥중앙점(Hand center, 우)
        [0.794374, 0.067817, 0.022872],  # 손바닥중앙점(Hand center, 좌)
    ]
    return standing, sitting


def get_names():
    standing = {
        "머리마루점, Occipital bone": -1,
        "눈초리점, Eye Socket, 우": -1,
        "눈초리점, Eye Socket, 좌": -1,
        "귀구슬점, Earlobe, 우": -1,
        "귀구슬점, Earlobe, 좌": -1,
        "귀바퀴위뿌리점, Tragus, 우": -1,
        "귀바퀴위뿌리점, Tragus, 좌": -1,
        "눈살점, Glabella": -1,
        "코뿌리점, Sellion": -1,
        "턱끝점, Menton": -1,
        "뒤통수 돌출점, Occiput": -1,
        "뒤통수점, Inion": -1,
        "머리옆점, Euryon, 우": -1,
        "머리옆점, Euryon, 좌": -1,
        "눈확아래점, Inferior Orbitale, 우": -1,
        "눈확아래점, Inferior Orbitale, 좌": -1,
        "목뒤점, Cervicale": -1,
        "목앞점, Anterior Neck": -1,
        "목옆점, Lateral Neck, 우": -1,
        "목옆점, Lateral Neck, 좌": -1,
        "방패연골아래점, Inferior Thyroid": -1,
        "어깨점, Acromion, 우": -1,
        "어깨점, Acromion, 좌": -1,
        "어깨가쪽점, Lateral Shoulder, 우": -1,
        "어깨가쪽점, Lateral Shoulder, 좌": -1,
        "겨드랑이점, Axilla, 우": -1,
        "겨드랑이점, Axilla, 좌": -1,
        "겨드랑앞점, Anterior Axilla, 우": -1,
        "겨드랑앞점, Anterior Axilla, 좌": -1,
        "겨드랑뒤점, Posterior Axilla, 우": -1,
        "겨드랑뒤점, Posterior Axilla, 좌": -1,
        "겨드랑앞벽점, AnterioridAxilla, 우": -1,
        "겨드랑앞벽점, AnterioridAxilla, 좌": -1,
        "겨드랑뒤벽점, PosterioridAxilla, 우": -1,
        "겨드랑뒤벽점, PosterioridAxilla, 좌": -1,
        "등뼈위겨드랑수준점, Axillary Level atidspine": -1,
        "겨드랑앞접힘점, Anterior Axillary Fold, 우": -1,
        "겨드랑앞접힘점, Anterior Axillary Fold, 좌": -1,
        "겨드랑뒤접힘점, Posterior Axilla Fold, 우": -1,
        "겨드랑뒤접힘점, Posterior Axilla Fold, 좌": -1,
        "복장뼈가운데점, Mesosternal": -1,
        "젖꼭지점, Nipple, 우": -1,
        "젖꼭지점, Nipple, 좌": -1,
        "젖가슴아래수준, Inferior Breast level, 우": -1,
        "젖가슴아래수준, Inferior Breast level, 좌": -1,
        "허리옆점, Lateral Waist, 우": -1,
        "허리옆점, Lateral Waist, 좌": -1,
        "허리앞점, Anterior Waist": -1,
        "허리뒤점, Posterior Waist": -1,
        "허리수준, Lateral Waist level, 우": -1,
        "허리수준, Lateral Waist level, 좌": -1,
        "중간허리수준, Midriff level, 우": -1,
        "중간허리수준, Midriff level, 좌": -1,
        "배돌출점, Stomach tip": -1,
        "배꼽점, Stomach navel": -1,
        "배꼽수준허리옆점, Lateral Waist omphalion, 우": -1,
        "배꼽수준허리옆점, Lateral Waist omphalion, 좌": -1,
        "배꼽수준허리뒤점, Posterior Waist omphalion": -1,
        "엉덩이돌출점, Buttock Protrusion, 우": -1,
        "엉덩이돌출점, Buttock Protrusion, 좌": -1,
        "엉덩이돌출점수준, Buttock Protrusion level, 우": -1,
        "엉덩이돌출점수준, Buttock Protrusion level, 좌": -1,
        "Top-hip점, Top-hip, 우": -1,
        "Top-hip점, Top-hip, 좌": -1,
        "Top-hip 수준, Top-hip level, 우": -1,
        "Top-hip 수준, Top-hip level, 좌": -1,
        "Upper-hip점, Upper-hip, 우": -1,
        "Upper-hip점, Upper-hip, 좌": -1,
        "Upper-hip 수준, Upper-hip level, 우": -1,
        "Upper-hip 수준, Upper-hip level, 좌": -1,
        "엉덩이최대둘레수준, Hip-width level, 우": -1,
        "엉덩이최대둘레수준, Hip-width level, 좌": -1,
        "볼기고랑점, Gluteal Fold, 우": -1,
        "볼기고랑점, Gluteal Fold, 좌": -1,
        "샅점, Crotch": -1,
        "무릎뼈위점, Superior Patella, 우": -1,
        "무릎뼈위점, Superior Patella, 좌": -1,
        "무릎뼈가운데점, Midpatella, 우": -1,
        "무릎뼈가운데점, Midpatella, 좌": -1,
        "무릎뼈아래점, Inferior Patella, 우": -1,
        "무릎뼈아래점, Inferior Patella, 좌": -1,
        "넙적다리가운데점, Midthigh, 우": -1,
        "넙적다리가운데점, Midthigh, 좌": -1,
        "오금점, Posterior Juncture of Calf and Thigh, 우": -1,
        "오금점, Posterior Juncture of Calf and Thigh, 좌": -1,
        "장딴지돌출점, Calf Protrusion, 우": -1,
        "장딴지돌출점, Calf Protrusion, 좌": -1,
        "종아리아래점, Inferior Leg, 우": -1,
        "종아리아래점, Inferior Leg, 좌": -1,
        "안쪽발목점, Inner Ankle, 우": -1,
        "안쪽발목점, Outer Ankle, 우": -1,
        "안쪽복사점, Medialalleous, 우": -1,
        "안쪽복사점, Medialalleous, 좌": -1,
        "가쪽복사점, Lateralalleous, 우": -1,
        "가쪽복사점, Medialalleous, 좌": -1,
        "손바닥중앙점, Hand center, 우": -1,
        "손바닥중앙점, Hand center, 좌": -1,
        "발바닥중앙점, Foot center, 우": -1,
        "발바닥중앙점, Foot center, 좌": -1,
        "팔꿈치아래점, Bottom olecranon, 우": -1,
        "팔꿈치아래점, Bottom olecranon, 좌": -1,
        "손목안쪽점, Ulnar Styloid, 우": -1,
        "손목안쪽점, Ulnar Styloid, 좌": -1,
        "두갈래근점, Biceps, 우": -1,
        "두갈래근점, Biceps, 좌": -1,
    }
    sitting = {
        "앉은넙다리위점, Superior Thigh, 우": -1,
        "앉은넙다리위점, Superior Thigh, 좌": -1,
        "앉은무릎뼈위점, Superior Patella, 우": -1,
        "앉은무릎뼈위점, Superior Patella, 좌": -1,
        "앉은무릎앞점, Anterior Knee, 우": -1,
        "앉은무릎앞점, Anterior Knee, 좌": -1,
        "오금점, Posterior Juncture of Calf and Thigh, 우": -1,
        "오금점, Posterior Juncture of Calf and Thigh, 좌": -1,
        "앉은엉덩이최대돌출수준, Hip level, 우": -1,
        "앉은엉덩이최대돌출수준, Hip level, 좌": -1,
        "배돌출점, Stomach tip": -1,
        "앉은엉덩이뒤돌출점, Gluteal Prominence": -1,
        "허리뒤점, Posterior Waist": -1,
        "팔꿈치아래점, Bottom olecranon, 우": -1,
        "팔꿈치아래점, Bottom olecranon, 좌": -1,
        "손바닥중앙점, Hand center, 우": -1,
        "손바닥중앙점, Hand center, 좌": -1,
    }
    return standing, sitting


def get_interactions():
    interactions = [
        ("머리위로뻗은주먹높이", "Overhead Fist Reach", ["Foot center, 우", "Hand center, 우"], "height", "hands-on"),
        ("키", "Stature", ["Foot center, 우", "Occipital bone"], "height", "standing"),
        ("목뒤높이", "Cervical Height", ["Foot center, 우", "Cervicale"], "height", "standing"),
        ("어깨높이", "Acromion Height", ["Foot center, 우", "Acromion, 우"], "height", "standing"),
        ("겨드랑높이", "Axilla Height", ["Foot center, 우", "Axilla, 우"], "height", "standing"),
        ("허리기준선높이", "Waist Height natural indentation", ["Foot center, 우", "Lateral Waist level, 우"], "height",
         "standing"),
        ("허리높이", "Waist Height", ["Foot center, 우", "Lateral Waist, 우"], "height", "standing"),
        ("위앞엉덩뼈가시높이", "Iliac Spine Height", ["Foot center, 우", "Top-hip, 우"], "height", "standing"),
        ("샅높이", "Crotch Height", ["Foot center, 우", "Crotch"], "height", "standing"),
        ("가쪽복사높이", "Lateralalleolus Height", ["Foot center, 우", "Lateralalleous, 우"], "height", "standing"),
        ("주먹높이", "Fist Height", ["Foot center, 우", "Hand center, 우"], "height", "standing"),
        ("팔꿈치높이", "Elbow Height", ["Foot center, 우", "Bottom olecranon, 우"], "height", "curve"),
        ("가슴너비", "Chest Breadth", ["Axilla, 좌", "Axilla, 우"], "width", "standing"),
        ("허리너비", "Waist Breadth", ["Lateral Waist, 좌", "Lateral Waist, 우"], "width", "standing"),
        ("엉덩이너비", "Hip Width", ["Buttock Protrusion level, 좌", "Buttock Protrusion level, 우"], "width", "standing"),
        ("발목너비", "Ankle Width", ["Inner Ankle, 우", "Outer Ankle, 우"], "width", "standing"),
        ("겨드랑두께", "Armscye Depth", ["Posterior Axilla, 우", "Anterior Axilla, 우"], "depth", "t"),
        ("가슴두께", "Chest Depth, Standing", ["AnterioridAxilla, 우", "PosterioridAxilla, 우"], "depth", "t"),
        ("허리두께", "Waist Depth", ["Anterior Waist", "Posterior Waist"], "depth", "t"),
        ("목둘레", "Neck Circumference", ["Inferior Thyroid", "Inferior Thyroid"], "circ-h", "standing"),
        ("목밑뒤길이", "Back Neck Base Length", ["Lateral Neck, 좌", "Lateral Neck, 우"], "length", "standing"),
        ("목밑둘레", "Neck Base Circumference", ["Lateral Neck, 좌", "Lateral Neck, 좌"], "circ-n", "standing"),
        ("겨드랑둘레", "Armscye Circumference", ["Acromion, 우", "Acromion, 우"], "circ-v", "standing"),
        ("편위팔둘레", "Upper Arm Circumference", ["Lateral Shoulder, 우", "Lateral Shoulder, 우"], "circ-v", "t"),
        ("편팔꿈치둘레", "Elbow Circumference", ["Bottom olecranon, 우", "Bottom olecranon, 우"], "circ-v", "t"),
        ("손목둘레", "Wrist Circumference", ["Ulnar Styloid, 우", "Ulnar Styloid, 우"], "circ-v", "t"),
        ("위팔둘레", "Upper Arm Circumference", ["Biceps, 우", "Biceps, 우"], "circ-h", "curve"),
        ("가슴둘레", "Chest Circumference", ["Anterior Axillary Fold, 우"], "circ-h", "standing"),
        ("젖가슴둘레", "Bust Circumference", ["Nipple, 우", "Nipple, 우"], "circ-h", "standing"),
        ("젖가슴아래둘레", "Underbust Circumference", ["Inferior Breast level, 우"], "circ-h", "standing"),
        ("허리둘레", "Waist Circumference", ["Anterior Waist"], "circ-h", "hands-on"),
        ("배꼽수준허리둘레", "Omphalion Circumference", ["Stomach navel"], "circ-h", "hands-on"),
        ("엉덩이둘레", "Hip Circumference", ["Buttock Protrusion level, 우"], "circ-h", "hands-on"),
        ("넙다리둘레", "Thigh Circumference", ["Midthigh, 우"], "circ-h", "hands-on"),
        ("무릎둘레", "Knee Circumference", ["Midpatella, 우"], "circ-h", "hands-on"),
        ("종아리둘레", "Calf Circumference", ["Calf Protrusion, 우"], "circ-h", "hands-on"),
        ("목옆뒤허리둘레선길이", "Neck Point to back Waistline", ["Lateral Neck, 우", "Lateral Waist level, 우"], "length", "t"),
        ("목옆젖꼭지길이", "Neck Shoulder Point to Nipple", ["Lateral Neck, 우", "Nipple, 우"], "length", "t"),
        ("목옆젖꼭지허리둘레선길이", "Neck Point to Breast Point to Waistline",
         ["Lateral Neck, 우", "Lateral Waist level, 우"], "length", "t"),
        ("샅앞뒤길이", "Crotch length", ["Anterior Waist", "Posterior Waist"], "length", "t"),
        ("어깨목뒤길이", "Shoulder to neck(half)", ["Cervicale", "Acromion, 좌"], "length", "standing"),
        ("목뒤어깨사이길이", "Shoulder to neck(full)", ["Acromion, 우", "Acromion, 좌"], "length", "standing"),
        ("위팔길이", "Upperarm Length", ["Acromion, 우", "Bottom olecranon, 우"], "width", "t"),
        ("팔길이", "Arm Length", ["Acromion, 우", "Ulnar Styloid, 우"], "width", "t"),
        ("앉은키", "Sitting Height", ["Occipital bone", "Gluteal Fold, 우"], "height", "sitting"),
        ("앉은배두께", "Sitting Height", ["Stomach tip", "Posterior Waist"], "depth", "sitting"),
        ("팔꿈치주먹수평길이", "Elbow-Grip Length", ["Hand center, 우", "Bottom olecranon, 우"], "depth", "sitting"),
    ]
    return interactions


def get_circ_coordinates():
    dictionary = {
        'Neck Circumference':
        [
            [-0.000006, -0.046593, 0.177639],  # 방패연골아래점(Inferior Thyroid)
            [0.010344, -0.045391, 0.179545],
            [0.021744, -0.039397, 0.184633],
            [0.032745, -0.02958, 0.191904],
            [0.044962, -0.0189, 0.199834],
            [0.055584, -0.006573, 0.205371],
            [0.060906, 0.007866, 0.210186],
            [0.059874, 0.022544, 0.214007],
            [0.054732, 0.035851, 0.216969],
            [0.041489, 0.056643, 0.215184],
            [0.028616, 0.067079, 0.214225],
            [0.000001, 0.073956, 0.209948],
            [-0.028616, 0.067081, 0.214223],
            [-0.047731, 0.047477, 0.218334],
            [-0.054736, 0.035855, 0.216965],
            [-0.059879, 0.022548, 0.214002],
            [-0.060883, 0.00773, 0.210065],
            [-0.055522, -0.006597, 0.205223],
            [-0.044911, -0.018697, 0.199543],
            [-0.032798, -0.029434, 0.191603],
            [-0.021901, -0.039412, 0.184367],
            [-0.010456, -0.045338, 0.179438],
        ],
        'Back Neck Base Length':
        [
            [0.060985, 0.007459, 0.180173],  # 목옆점(Lateral Neck, 좌)
            [0.059636, 0.041961, 0.189892],
            [0.057682, 0.063611, 0.184808],
            [0.02894, 0.081722, 0.179299],
            [0.015851, 0.090695, 0.169348],
            [0.000004, 0.097569, 0.157897],  # 목뒤점(Cervicale)
            [-0.030588, 0.089513, 0.167989],
            [-0.058419, 0.074248, 0.17654],
            [-0.065619, 0.049289, 0.182539],
            [-0.067154, 0.032751, 0.17677],
            [-0.060985, 0.007459, 0.180173],  # 목옆점(Lateral Neck, 우)
        ],
        'Neck Base Circumference':
        [
            [-0.060985, 0.007459, 0.180173],  # 목옆점(Lateral Neck, 우)
            [-0.052442, -0.009358, 0.155082],
            [-0.041219, -0.018907, 0.145894],
            [-0.027558, -0.027193, 0.140535],
            [-0.013742, -0.031438, 0.137134],
            [0.000005, -0.030337, 0.12267],  # 목앞점(Anterior Neck)
            [0.014347, -0.031248, 0.126773],
            [0.02885, -0.027067, 0.129618],
            [0.044594, -0.018026, 0.134753],
            [0.061442, -0.004971, 0.144076],
            [0.060985, 0.007459, 0.180173],  # 목옆점(Lateral Neck, 좌)
            [0.059636, 0.041961, 0.189892],
            [0.057682, 0.063611, 0.184808],
            [0.02894, 0.081722, 0.179299],
            [0.015851, 0.090695, 0.169348],
            [0.000004, 0.097569, 0.157897],  # 목뒤점(Cervicale)
            [-0.030588, 0.089513, 0.167989],
            [-0.058419, 0.074248, 0.17654],
            [-0.065619, 0.049289, 0.182539],
            [-0.067154, 0.032751, 0.17677],
        ],
        'Armscye Circumference':
        [
            [-0.179889, 0.024175, 0.151491],  # 어깨점(Acromion, 우)
            [-0.187427, -0.005228, 0.134497],
            [-0.198512, -0.023011, 0.098958],
            [-0.201268, -0.031214, 0.06819],
            [-0.211689, -0.018795, 0.033518],
            [-0.207827, -0.004973, 0.017877],  # 겨드랑앞점(Anterior Axilla, 우)
            [-0.221789, 0.028579, -0.003102],  # 겨드랑이점(Axilla, 우)
            [-0.222151, 0.082484, -0.004028],  # 겨드랑뒤점(Posterior Axilla, 우)
            [-0.216753, 0.091868, 0.008806,],
            [-0.207656, 0.102032, 0.032671, ],
            [-0.205917, 0.107738, 0.059223, ],
            [-0.205104, 0.100928, 0.089491, ],
            [-0.192491, 0.082761, 0.118118],
            [-0.189388, 0.048007, 0.1468],
        ],
        'Upper Arm Circumference':
        [
            [-0.291646, 0.044912, 0.109481],  # New point 어깨와 이두 분리선
            [-0.293038, 0.025564, 0.10069],
            [-0.293512, 0.010498, 0.087364],
            [-0.29518, 0.001205, 0.069639],
            [-0.296045, 0.000374, 0.050203],
            [-0.297682, 0.007186, 0.034042],
            [-0.300135, 0.018921, 0.021892],
            [-0.309045, 0.046607, 0.004479],
            [-0.312767, 0.072405, 0.000397],
            [-0.307952, 0.094321, 0.016057],
            [-0.325535, 0.100309, 0.057412],
            [-0.320013, 0.086952, 0.087977],
        ],
        'Elbow Circumference':
        [
            [-0.464522, 0.097318, 0.057199],  # 팔꿈치아래점(Bottom olecranon, 우)
            [-0.465342, 0.067361, 0.085757],
            [-0.468475, 0.052521, 0.093304],
            [-0.471482, 0.03592, 0.089267],
            [-0.472317, 0.024282, 0.077405],
            [-0.472361, 0.022717, 0.045302],
            [-0.476505, 0.027083, 0.016641],
            [-0.479732, 0.053074, -0.004027],
            [-0.477352, 0.071838, -0.002718],
            [-0.471739, 0.087575, 0.006329],
            [-0.464283, 0.099289, 0.020812],
            [-0.465393, 0.103809, 0.040736],
        ],
        'Wrist Circumference':
        [
            [-0.715033, 0.093531, 0.048505],  # 손목안쪽점(Ulnar Styloid, 우)
            [-0.715322, 0.089781, 0.059492],
            [-0.716293, 0.079494, 0.065458],
            [-0.717747, 0.068127, 0.067565],
            [-0.719685, 0.055603, 0.068202],
            [-0.721154, 0.043446, 0.06338],
            [-0.721175, 0.035193, 0.054563],
            [-0.720039, 0.033075, 0.043991],
            [-0.718371, 0.036239, 0.033144],
            [-0.716631, 0.045225, 0.027073],
            [-0.716508, 0.064283, 0.021501],
            [-0.716251, 0.083766, 0.024933],
            [-0.715975, 0.089287, 0.030319],
            [-0.715369, 0.092303, 0.038228],
        ],
        'Chest Circumference':
        [
            [-0.033624, -0.094782, 0.008261],
            [-0.052381, -0.095828, 0.012908],
            [-0.070592, -0.094774, 0.015162],
            [-0.088033, -0.091923, 0.016145],
            [-0.104261, -0.08786, 0.016091],
            [-0.119188, -0.082736, 0.015198],
            [-0.132122, -0.077581, 0.013038],
            [-0.14373, -0.071498, 0.009916],
            [-0.153804, -0.064326, 0.005053],
            [-0.161635, -0.055208, -0.002019],
            [-0.178634, -0.022394, -0.004768],
            [-0.178895, -0.005516, -0.015543],
            [-0.182314, 0.011431, -0.025796],
            [-0.187816, 0.0291, -0.03517],
            [-0.191972, 0.047237, -0.039129],
            [-0.193045, 0.063886, -0.039325],
            [-0.191448, 0.077855, -0.036589],
            [-0.181845, 0.089978, -0.039362],
            [-0.169905, 0.102999, -0.04142],
            [-0.150957, 0.117934, -0.041561],
            [-0.121412, 0.132831, -0.037922],
            [-0.101208, 0.13612, -0.048201],
            [-0.076354, 0.138048, -0.061427],
            [-0.044635, 0.140051, -0.058557],
            [-0.020525, 0.134721, -0.05755],
            [0.020525, 0.134721, -0.05755],
            [0.044635, 0.140051, -0.058557],
            [0.076354, 0.138048, -0.061427],
            [0.101208, 0.13612, -0.048201],
            [0.121412, 0.132831, -0.037922],
            [0.150957, 0.117934, -0.041561],
            [0.169905, 0.102999, -0.04142],
            [0.181845, 0.089978, -0.039362],
            [0.191448, 0.077855, -0.036589],
            [0.193045, 0.063886, -0.039325],
            [0.191972, 0.047237, -0.039129],
            [0.187816, 0.0291, -0.03517],
            [0.182314, 0.011431, -0.025796],
            [0.178895, -0.005516, -0.015543],
            [0.178634, -0.022394, -0.004768],
            [0.161635, -0.055208, -0.002019],
            [0.153804, -0.064326, 0.005053],
            [0.14373, -0.071498, 0.009916],
            [0.132122, -0.077581, 0.013038],
            [0.119188, -0.082736, 0.015198],
            [0.104261, -0.08786, 0.016091],
            [0.088033, -0.091923, 0.016145],
            [0.070592, -0.094774, 0.015162],
            [0.052381, -0.095828, 0.012908],
            [0.033624, -0.094782, 0.008261],
        ],
        'Bust Circumference':
        [
            [-0.107037, -0.105581, -0.050393],  # 젖꼭지점(Nipple, 우)
            [-0.118102, -0.099318, -0.051216],
            [-0.126826, -0.091327, -0.051362],
            [-0.139374, -0.077354, -0.050512],
            [-0.147615, -0.064745, -0.051533],
            [-0.157504, -0.045015, -0.052037],
            [-0.172589, -0.002564, -0.059477],
            [-0.179968, 0.038642, -0.069212],
            [-0.176937, 0.075897, -0.065181],
            [-0.148871, 0.10755, -0.063221],
            [-0.118564, 0.126054, -0.064624],
            [-0.076354, 0.138048, -0.061427],
            [-0.044635, 0.140051, -0.058557],
            [0.044637, 0.140048, -0.058555],
            [0.076355, 0.138045, -0.061423],
            [0.118561, 0.126048, -0.064619],
            [0.148861, 0.107545, -0.063213],
            [0.170103, 0.091898, -0.059371],
            [0.181992, 0.076323, -0.05414],
            [0.184048, 0.041992, -0.056924],
            [0.172595, -0.002573, -0.059476],
            [0.157511, -0.045026, -0.052036],
            [0.147623, -0.064757, -0.051533],
            [0.139381, -0.077366, -0.050512],
            [0.134161, -0.083728, -0.05096],
            [0.126832, -0.09134, -0.051363],
            [0.118108, -0.099331, -0.051217],
            [0.107042, -0.105592, -0.050393],
            [0.094976, -0.109141, -0.048374],
            [0.055098, -0.112849, -0.046246],
            [-0.038979, -0.109408, -0.057167],
            [-0.076279, -0.112092, -0.054112],
            [-0.094972, -0.109132, -0.048373],
            [-0.107037, -0.105581, -0.050393],
        ],
        'Underbust Circumference':
        [
            [0.000004, -0.115163, -0.117233],
            [-0.026275, -0.115912, -0.114745],
            [-0.051306, -0.11276, -0.11313],
            [-0.094946, -0.098421, -0.119217],
            [-0.126416, -0.072357, -0.118467],
            [-0.141385, -0.054797, -0.114868],  # 젖가슴아래수준(Inferior Breast level, 우)
            [-0.165747, 0.00183, -0.114928],
            [-0.167777, 0.02975, -0.116884],
            [-0.163615, 0.055436, -0.115099],
            [-0.154961, 0.078106, -0.110888],
            [-0.13423, 0.098485, -0.121101],
            [-0.115278, 0.114135, -0.111501],
            [-0.087403, 0.120573, -0.122197],
            [-0.065056, 0.128258, -0.114446],
            [-0.041928, 0.130525, -0.109293],
            [-0.01992, 0.126082, -0.10603],
            [0.01992, 0.126082, -0.10603],
            [0.041928, 0.130525, -0.109293],
            [0.065056, 0.128258, -0.114446],
            [0.087403, 0.120573, -0.122197],
            [0.115278, 0.114135, -0.111501],
            [0.13423, 0.098485, -0.121101],
            [0.154961, 0.078106, -0.110888],
            [0.163615, 0.055436, -0.115099],
            [0.167777, 0.02975, -0.116884],
            [0.165747, 0.00183, -0.114928],
            [0.141385, -0.054797, -0.114868],  # 젖가슴아래수준(Inferior Breast level, 좌)
            [0.126416, -0.072357, -0.118467],
            [0.094946, -0.098421, -0.119217],
            [0.051306, -0.11276, -0.11313],
            [0.026275, -0.115912, -0.114745]
        ],
        'Waist Circumference':
        [
            [0.000004, -0.132918, -0.233358],  # 허리앞점(Anterior Waist)
            [-0.022022, -0.132918, -0.235033],
            [-0.043977, -0.129023, -0.233673],
            [-0.064247, -0.119591, -0.2323],
            [-0.08408, -0.104579, -0.231497],
            [-0.103086, -0.08843, -0.231183],
            [-0.12231, -0.072758, -0.228993],
            [-0.138503, -0.054331, -0.224978],
            [-0.149972, -0.032545, -0.220687],
            [-0.155495, -0.007942, -0.216804],
            [-0.153928, 0.017465, -0.213369],
            [-0.145383, 0.041624, -0.210266],
            [-0.131452, 0.062891, -0.206347],
            [-0.116045, 0.079829, -0.202454],
            [-0.082798, 0.098651, -0.218412],
            [-0.061963, 0.102726, -0.21654],
            [0.061963, 0.102726, -0.21654],
            [0.082798, 0.098651, -0.218412],
            [0.116045, 0.079829, -0.202454],
            [0.131452, 0.062891, -0.206347],
            [0.145383, 0.041624, -0.210266],
            [0.153928, 0.017465, -0.213369],
            [0.155495, -0.007942, -0.216804],
            [0.149972, -0.032545, -0.220687],
            [0.138503, -0.054331, -0.224978],
            [0.12231, -0.072758, -0.228993],
            [0.103086, -0.08843, -0.231183],
            [0.08408, -0.104579, -0.231497],
            [0.064247, -0.119591, -0.2323],
            [0.043977, -0.129023, -0.233673],
            [0.022022, -0.132918, -0.235033],
        ],
        'Omphalion Circumference':
        [
            [-0.02872, -0.133792, -0.290152],
            [-0.046692, -0.131237, -0.287053],
            [-0.064831, -0.123409, -0.284118],
            [-0.083575, -0.109474, -0.281288],
            [-0.102764, -0.093452, -0.278089],
            [-0.139964, -0.059486, -0.268368],
            [-0.161411, -0.012044, -0.256367],
            [-0.161614, 0.014964, -0.251493],
            [-0.154476, 0.040046, -0.247719],
            [-0.124898, 0.078319, -0.243415],
            [-0.08558, 0.096216, -0.241224],
            [-0.043252, 0.099316, -0.239186],
            [0.043252, 0.099316, -0.239186],
            [0.08558, 0.096216, -0.241224],
            [0.124898, 0.078319, -0.243415],
            [0.124898, 0.078319, -0.243415],
            [0.154476, 0.040046, -0.247719],
            [0.161614, 0.014964, -0.251493],
            [0.161411, -0.012044, -0.256367],
            [0.139964, -0.059486, -0.268368],
            [0.102764, -0.093452, -0.278089],
            [0.083575, -0.109474, -0.281288],
            [0.064831, -0.123409, -0.284118],
            [0.046692, -0.131237, -0.287053],
            [0.02872, -0.133792, -0.290152],
        ],
        'Hip Circumference':
        [
            [-0.0314, 0.153119, -0.416488],
            [-0.061006, 0.153625, -0.415752],  # 엉덩이돌출점(Buttock Protrusion, 우)
            [-0.110482, 0.136197, -0.416763],
            [-0.130566, 0.119126, -0.417682],
            [-0.147169, 0.097504, -0.416073],
            [-0.161293, 0.072623, -0.41488],
            [-0.172119, 0.045244, -0.415227],
            [-0.17984, 0.015241, -0.417428],
            [-0.181751, -0.014406, -0.425528],
            [-0.152082, -0.062921, -0.41682],
            [-0.098137, -0.088724, -0.41456],
            [-0.052579, -0.106212, -0.401606],
            [-0.033349, -0.111456, -0.405313],
            [-0.01571, -0.114328, -0.408412],
            [0.01571, -0.114328, -0.408412],
            [0.033349, -0.111456, -0.405313],
            [0.052579, -0.106212, -0.401606],
            [0.098137, -0.088724, -0.41456],
            [0.152082, -0.062921, -0.41682],
            [0.181751, -0.014406, -0.425528],
            [0.17984, 0.015241, -0.417428],
            [0.172119, 0.045244, -0.415227],
            [0.161293, 0.072623, -0.41488],
            [0.147169, 0.097504, -0.416073],
            [0.130566, 0.119126, -0.417682],
            [0.110482, 0.136197, -0.416763],
            [0.061006, 0.153625, -0.415752],  # 엉덩이돌출점(Buttock Protrusion, 우)
            [0.0314, 0.153119, -0.416488],
        ],
        'Thigh Circumference':
        [
            [-0.139573, -0.085031, -0.589604],  # 넙적다리가운데점(Midthigh, 우)
            [-0.165573, -0.061223, -0.58243],
            [-0.181648, -0.024971, -0.574913],
            [-0.184853, 0.015689, -0.565948],
            [-0.174501, 0.052668, -0.560616],
            [-0.15018, 0.080767, -0.563028],
            [-0.119196, 0.09812, -0.565136],
            [-0.085759, 0.105428, -0.559978],
            [-0.052224, 0.100657, -0.547603],
            [-0.040815, 0.088774, -0.568534],
            [-0.013214, 0.060543, -0.578132],
            [-0.002619, 0.030357, -0.589802],
            [-0.002599, 0.000365, -0.600922],
            [-0.008883, -0.02606, -0.608243],
            [-0.023243, -0.048702, -0.612299],
            [-0.044807, -0.067953, -0.616471],
            [-0.072996, -0.084265, -0.620525],
            [-0.107353, -0.093893, -0.591504],
        ],
        'Knee Circumference':
        [
            [-0.095054, -0.036428, -0.893663],  # 무릎뼈가운데점(Midpatella, 우)
            [-0.12209, -0.027441, -0.893477],
            [-0.134595, -0.005053, -0.88995],
            [-0.146847, 0.021937, -0.882966],
            [-0.150515, 0.045003, -0.875294],
            [-0.138496, 0.064445, -0.868112],
            [-0.125446, 0.080038, -0.862809],
            [-0.109034, 0.087189, -0.860481],
            [-0.091315, 0.08765, -0.860128],
            [-0.074484, 0.082288, -0.861845],
            [-0.057314, 0.077981, -0.864631],
            [-0.042748, 0.068649, -0.867877],
            [-0.034302, 0.053191, -0.873707],
            [-0.034322, 0.033584, -0.880427],
            [-0.043285, 0.016262, -0.886542],
            [-0.0577, -0.002266, -0.890492],
            [-0.07089, -0.026258, -0.893012],
        ],
        'Calf Circumference':
        [
            [-0.106494, 0.121945, -1.02879],  # 장딴지돌출점(Calf Protrusion, 우)
            [-0.083264, 0.119191, -1.03078],
            [-0.064707, 0.109499, -1.03385],
            [-0.051808, 0.095271, -1.03612],
            [-0.045176, 0.077678, -1.03757],
            [-0.045473, 0.054992, -1.03909],
            [-0.056671, 0.033743, -1.04036],
            [-0.07955, 0.019168, -1.0451],
            [-0.103383, 0.004553, -1.04851],
            [-0.131338, 0.005483, -1.04657],
            [-0.153918, 0.025825, -1.04063],
            [-0.164637, 0.055539, -1.03552],
            [-0.161514, 0.083405, -1.0312],
            [-0.14879, 0.104362, -1.02827],
            [-0.129508, 0.117681, -1.02742],
        ]
    }
    return dictionary

